#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Создайте список из 10 четных чисел и выведите его с помощью цикла for
"""

list_ = 10*[2]

for i in list_:
    print(i)
