#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Имеется кортеж списков, в которых перечислены названия фруктов и
калорийность:
fruit = (['яблоки', 46], ['персики', 49], ['лимоны', 36], ['виноград', 190])
Калорийность винограда указана ошибочно. Напишите программу, которая
исправит калорийность на 75, и добавит в третий элемент кортежа новое значение ['айва', 42].
"""

fruit = (['яблоки', 46], ['персики', 49], ['лимоны', 36], ['виноград', 190])

fruit[-1][-1] = 75

fruit[2][2:4] = ['айва', 42]
print(fruit)
