#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Напишите программу, которая на основе исходного кортежа создает
новый кортеж, из которого исключены все пользователи с номерами телефонов с
региональным кодом +56.
Исходный кортеж:
info = (('Евгений Романов', 25, '+56(983)354-67-21'),
('Марина Дятлова', 22, '+56(190)251-45-79'),
('Кирилл Кудрявцев', 34, '+7(890)456-12-42'),
('Сергей Дятлов', 24, '+56(190)156-42-99'),
('Юлия Степанова', 21, '+16(398)355-33-09'),
('Тимофей Иванов', 34, '+7(918)222-52-77'))
"""

info = (('Евгений Романов', 25, '+56(983)354-67-21'),
('Марина Дятлова', 22, '+56(190)251-45-79'),
('Кирилл Кудрявцев', 34, '+7(890)456-12-42'),
('Сергей Дятлов', 24, '+56(190)156-42-99'),
('Юлия Степанова', 21, '+16(398)355-33-09'),
('Тимофей Иванов', 34, '+7(918)222-52-77'))

new_info = []
for i in range(len(info)):
    if info[i][-1][:3] != "+56":
        new_info += [info[i]]
info = tuple(new_info)
print(info)
