#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Представим, что у нас далёкое будущее и мы можем заниматься спортом на
планетах со странными перепадами температур. 

Спортсмен бегает по стадиону до тех пор, пока температура на улице больше 15 градусов. 

Он пробегает 20 метров, затем температура падает на два градуса, 

и, если уже в этот момент она стала <= 15 градусам, спорт сразу заканчивается. 

Если же всё в порядке, то он проходит пешком ещё 10 метров. Затем всё это повторяется.

Напишите программу, которая спрашивает у пользователя, сколько на улице
градусов, и, исходя из погоды, считает количество пройденных по стадиону
метров и выводит ответ на экран.
"""
t = int(input())
m = 0
while t > 15:
    m += 20
    t -= 2
    if t <= 15:
        break
    else:
        m += 10
print(m)
