#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Напишите программу, которая выводит на первой строчке «Привет, Яндекс!», а на второй –
«Приятно познакомиться.»
"""

print('Привет, Яндекс!')
print('Приятно познакомиться.')
