#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Организуйте вывод памятки для начинающего программиста. Вам нужно написать
программу так, чтобы расчет значения в последней строке выполнялся непосредственно перед ее
выводом и подставлялся вместо ХХХХ.
"""

print("""1 бит - минимальная единица количества информации.
1 байт = 8 бит.
1 Килобит = 1024 бита.
1 Килобайт = 1024 байта.""")
print(f"1 Килобайт = {1024*8} бит.")
