#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Напишите программу, которая считывает с клавиатуры
последовательно: имя, фамилию, любимое животное, знак зодиака.
"""
x = input()
y = input()
z = input()
w = input()

print( f"""Индивидуальный гороскоп для пользователя {x} {y}
Кем вы были в прошлой жизни: {z}
Ваш знак зодиака - {w} , поэтому вы - тонко чувствующая натура.""")
