#! /usr/bin/env python3
# vim:fenc=utf-8
#
# Copyright © 2025 rl <rl@rlcuber>
#
# Distributed under terms of the MIT license.

"""
Напишите программу, которая считывает с клавиатуры последовательно три строки:
название фильма, название кинотеатра и время, после чего выводит на экран «Билет на "
[название фильма] " в " [название кинотеатра] " на [время] забронирован.».
"""

print(f"Билет на \"{input()}\" в {input()} на {input()} забронирован")
